<?php
/*
http://www.beautyoftheweb.com/
http://ie6countdown.com/
http://code.google.com/chrome/chromeframe/
*/
$title = 'HTML5 for Windows XP';
$heading = 'HTML5 for Windows XP';

$content = <<<ENDCONTENT
<p class="intro">هذه دعوة لجميع المحاربين لتشجيع مستخدمى ويندوز إكس بى على أن يبتعدوا عن إنترنت إكسبلرور, ليساعدونا جميعا كى نجعل اﻷنترنت مكانا أكثر ثراءاً و أكثر متعة.</p>
<p>اﻷنترنت هو مكان رائع بالفعل. إنه وسيط إعلامى للجميع و مكان لتجد فيه كل ما تحتاج, و يجب ان نهتم به و نطوره كوسيلة إعلام أساسية و نستغل كل قدراته إلى أقصى حد بنفس المقدار الذى نستغل به وسائل اﻷعلام اﻷخرى.</p>
<p>على مر السنين ، نمت شبكة الانترنت واستخدامنا لها نمى أيضا. نحن نريد أكثر من بعض النصوص المضاف إليها بعض الصور الجميلة و نماذج نقوم بتعبئتها و إرسالها. لكى نجعل اﻷنترنت سهل اﻷستخدام للجميع, نحن نحتاج أن نحدث بنية اﻷنترنت التحتية و تحديث البرامج التى نستخدمها فى تصفحه.</p>
<p>ميكروسوفت تقوم بحملة <a href="http://www.beautyoftheweb.com/">انترنت جميل</a> مع بداية إطلاقها لمتصفحها الجديد إنترنت إكسبلرور 9 و تحث الناس على أن يتوقعوا أكثر مما سبق فى تعاملهم اليومى مع اﻷنترنت, لكن اﻷصدارة التاسعة من إنترنت إكسبلرور هى فقط متوافرة لمستخدمى نظام ويندوز فيزتا و ويندوز سفن, هؤلاء الذين يستخدمون ويندوز إكس بى (ﻷنه جيد بما يكفى لإحتياجاتهم) ﻷيمكنهم أن يحصلوا على إنترنت جميل.</p>
<p>مستخدمى ويندوز إكس بى يمكنهم فقط التحديث إلى اﻷصدارة الثامنة من إنترنت إكسبلرور كبديل للأصدارة السادسة الشنيعة و التى <a href="http://ie6countdown.com/">ميكروسوفت نفسها تريد أن تتخلص منها</a>.</p>
<p><strong>هذا ليس عدلاً و هذا لا يساعد اﻷنترنت.</strong></p>
<p>يجب على مستخدمى ويندوز إكس بى أن يديروا ظهورهم إلى أنترنت أكسبلرور و يختاروا متصفح إنترنت أفضل.</p>
<h2>هل هناك حل ﻹصلاح متصفحك الحالى؟</h2>
<p>إن كنت لا تستطيع تثبيت متصفح إنترنت جديد على نظام تشغيل حاسوبك, قم بتثبيت اﻹضافة <a href="http://code.google.com/chrome/chromeframe/">جوجل فريم</a> على اﻷقل لتحسين متصفحك القديم.</p>
<h2>ما الذى يمكننا فعله مع متصفحات إنترنت أفضل</h2>
<p>لغة إتش تى أم إل اﻷصدارة الخامسة و التقنيات اﻷخرى ذات الصلة هى تطور اﻷنترنت. فبدلا من إستخدام الكثير من اﻷكواد العقيمة لمحاولة محاكاة ما يجب أن تقم به متصفحات اﻷنترنت لنا بدون مجهود كبير منا, لدينا اﻷن العديد من اﻷدوات و النظم القوية التى يمكننا ان نستخدمها لجعل اﻷنترنت مكانا أكثر إثارة و إمتاع, فقط فكر فى ما يمكننا أن نقوم به:</p>
<ul>
<li>دعم داخلى للفيديو و الصوت بدون حاجة ﻹضافات خارجية مع دعم إختصارات لوحة المفاتيح, مع قدرة على التحكم الكامل فى كيفية العرض و أشياء أخرى.</li>
<li> نماذج أكثر ثراءا مع بعض أنواع الحقول الجديدة مثل حقل أختيار اﻷلوان, و التاريخ و اﻷكمال التلقائى لمحتويات الحقل.</li>
<li> الجوانب المستديرة و تدريجات اﻷلوان و الظلال بدون الحاجة إلى أى صور إضافية.</li>
<li>تخزين البيانات على حاسوب المستخدم و تخزين البيانات فى حالة عدم اﻷتصال باﻷنترنت لمحاكاة قدرات البرامج التى تشغلها على نظام تشغيلك.</li>
<li> إستخدام معلومات مكانك الجغرافى و إتجاه ميل جهازك ﻹعطائك تجربة أنترنت أكثر خصوصية.</li>
<li> السماح بصنع رسوميات أفضل بإستخدام تقنيات الكانفس و الأس فى جى.</li>
<li> إمكانية صنع العاب لا تجبرك على تثبيت إضافات خارجية لتشغيلها.</li>
<li> رسوميات ثلاثية اﻷبعاد و دعم ﻷى نوع من خطوط الكتابة.</li>
<li>دعم خاصية السحب و الإسقاط و دعم اللمس للحواسيب  اللوحية.</li>
<li>- دعم رفع الملفات و إمكانية الوصول إلى نظام الملفات مثل أى برنامج أخر مثبت على نظام تشغيل حاسوبك.</li>
</ul>
<p>كل هذا يمكن أن يصبح ملكك - فقط أترك إنترنت إكسبلرور إن كنت تستخدم ويندوز إكس بى.</p>
ENDCONTENT;

$sideheader = 'اللغة: العربية';
$sidecontent = 'إذا كنت مستخدم ويندوز إكس بى و لا تستطيع أو لا تريد التحديث إلى فيزتا أو ويندوز سفن, غير متصفحك من أنترنت إكسبلرور إلى متصفح أخر يدعم التقنيات الحديثة, من فضلك قم بتحميل أى من التالى:';

$footer = <<<ENDCONTENT
<p>كُتٍب بواسطة كريس هيلمان, بدعم من اﻷزعاج و ذكريات الساعات المُهدرة فى إصلاح مشاكل أنترنت إكسبلرور 6 بدلا من القيام بتجربة التقنيات الجديدة الرائعة.
Translation: <a href="http://shreef.com">Ahmed Shreef</a></p>
ENDCONTENT;
?>
