<?php
$title = 'HTML5 for Windows XP';
$heading = 'HTML5 for Windows XP';

$content = <<<ENDCONTENT
  <p class="intro">Это призыв ко всем пользователям windows XP прекратить, наконец, использование браузера Internet Explorer, и тем самым общими усилиями сделать интернет богаче и комфортнее.</p>
  <p>Интернет сам по себе удивительное место. Средство массовой информации для всех и каждого, а так же место, где можно найти всё что угодно. Нам нужно заботиться об интернете, постоянно улучшать и использовать его на всю мощь, точно так же, как мы поступаем с другими источниками информации.</p>
  <p>За последние годы интернет и количество его пользователей только увеличивалось. И теперь нам хочется намного больше, чем просто читать тексты с красивыми картинками и формами, которые можно заполнять и отсылать. Нам нужно обновить инфраструктуру интернета и программное обеспечение, чтобы сделать интернет удобнее в использовании для всех.</p>
  <p>Точно так же, как нужна прямая и ровная дорога для быстрой езды и экономии топлива, нужны и современные браузеры для получения максимального результата от сегодняшнего интернета.</p>
  <p>Microsoft рекламирует <a href="http://www.beautyoftheweb.com/">красивый интернет</a>, который принесёт Internet Explorer 9 и уверяет людей в более насыщенном каждодневном использовании интернета, но так как IE9 доступен лишь для пользователей Windows Vista и Windows 7, то те, кто использует Windows XP (так как он их полностью устраивает), не смогут ощутить всей красоты интернета.</p>
  <p>Пользователи Windows XP могут обновиться лишь до IE8, в качестве замены бесконечно устаревшему IE6, который даже Microsoft считает - <a href="http://ie6countdown.com/">пережитком прошлого</a>.</p>
  <p><strong>Это несправедливо и никакой пользы интернету не несёт.</strong></p>
  <p>Пользователям Windows XP следует отказаться от Internet Explorer и выбрать более качественный браузер.</p>
  <h2>Как исправить ваш браузер?</h2>
  <p>Если вам по каким-либо причинам нельзя установить другой браузер на компьютер, то обратите внимание на <a href="http://code.google.com/chrome/chromeframe/">Google Chrome Frame</a>, чтоб устранить хотя бы основные недочёты.</p>
  <h2>Какие возможности открываются перед нами с современными браузерами?</h2>
  <p>HTML5 и родственные ему технологии - это "<strong>эволюция сегодняшнего интернета</strong>". Вместо того, чтобы писать бессмысленный код для симуляции того, что браузеры и так должны поддерживать, лучше использовать новые элементы и мощные системы для перевоплощения интернета в ещё более интересную и простую в использовании среду. Просто задумайтесь о том, что уже сейчас мы можем делать:</p>
  <ul>
  <li>Браузерное видео и аудио с управлением через клавиатуру и возможностью вносить изменения на лету, как нам того захочется.</li>
  <li>Поля, имеющие богатый набор возможностей, такие как манипуляторы цветами, календари и автоматически заполняющиеся поля.</li>
  <li>Закруглённые уголки, градиенты, тени, и всё это без дополнительных действий в графических редакторах.</li><li>Хранение данных на компьютере и в сети, как при использовании программного обеспечения.</li>
  <li>При помощи данных геолокации и используемой техники (смартфон, планшет, лаптоп и.т.д.) создаётся индивидуальное интернет пространство, основанное на ваших интересах и потребностях.</li>
  <li>Возможность создания продвинутых графиков и визуального оформления используя Canvas и SVG.</li>
  <li>Создание игр, которые не будут требовать установки дополнительных плагинов (plug-ins).</li>
  <li>Трёхмерная графика и поддержка любого шрифта.</li>
  <li>"Drag and drop" и поддержка сенсорного управления для планшетов.</li>
  <li>Действия с файлами (загрузка, копирование) точно такие же, как и в любых других программах.</li>
  </ul>
  <p>Всё это вы можете испытать - нужно лишь отказаться от Internet Explorer, если вы продолжаете использовать XP.</p>
ENDCONTENT;

$sideheader = 'Сделайте интернет лучше при помощи современного браузера!';
$sidecontent = 'Если вы являетесь пользователем Windows XP и не имеете возможности или не хотите перейти на ОС Windows Vista или Windows 7, то смените Internet Explorer на более современный и поддерживающий новые технологии браузер. Пожалуйста, загрузите любой из ниже представленных:';

$footer = <<<ENDCONTENT
<p>Автор - Chris Heilmann. Вдохновлено головной болью и часами, потраченными на устранение ошибок IE6, вместо того, чтобы играться с новыми, занимательными технологиями. Translation: <a href="http://twitter.com/vadisave">Vadim Saveljev</a></p>
ENDCONTENT;
?>